{
  "GeneralProvisions": [
    {
      "title": "Purpose",
      "content": "The purpose of this Act is to promote the use of bicycles as an eco-friendly mode of transportation, ensuring safety and convenience for users."
    },
    {
      "title": "Definitions",
      "content": {
        "bicycle": "A vehicle powered by pedals, having two or more wheels, designed for single or tandem use.",
        "electric_bicycle": "A bicycle equipped with an auxiliary motor that meets specific safety standards."
      }
    }
  ],
  "BicycleInfrastructure": [
    {
      "title": "Bicycle Road Construction and Maintenance",
      "content": "Local governments must construct and maintain bicycle roads to promote safe and convenient bicycle use."
    },
    {
      "title": "Public Bicycle Rental Systems",
      "content": "Municipalities may operate public bicycle rental systems to provide easy access to bicycles."
    },
    {
      "title": "Bicycle Parking Facilities",
      "content": "Bicycle parking facilities should be established near public transport stations, schools, and major facilities."
    }
  ],
  "BicyclePromotion": [
    {
      "title": "Education and Public Awareness",
      "content": "The government and local authorities must provide educational programs and campaigns to raise public awareness of bicycle safety and usage."
    },
    {
      "title": "Financial Support for Bicycle Use",
      "content": "Financial incentives, such as subsidies or tax benefits, may be provided to encourage bicycle use."
    }
  ],
  "Regulations": [
    {
      "title": "Prohibited Bicycle Modifications",
      "content": "Any modification to bicycles, particularly electric bicycles, that violates safety standards is prohibited."
    },
    {
      "title": "Illegal Parking",
      "content": "Bicycles must not be parked in a way that obstructs pedestrian paths or public spaces."
    },
    {
      "title": "Bicycle Registration",
      "content": "Local governments may introduce a bicycle registration system to prevent theft and enhance user accountability."
    }
  ],
  "Penalties": [
    {
      "title": "Fines for Violations",
      "content": "Violators of this Act may face fines up to 500,000 KRW depending on the severity of the violation."
    },
    {
      "title": "Electric Bicycle Safety Violations",
      "content": "Fines or imprisonment may apply for using or modifying electric bicycles in violation of safety regulations."
    }
  ]
}
